app/controllers/api/activities_controller.rb

    def show
        @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]

    def index
        @activities = Activity.all
---
SELECT "activities".* FROM "activities"

    def create
        @activity = Activity.new(activity_params)
        debugger
        if @activity.save
            @activities = Activity.all
---
INSERT INTO "activities" ("title", "sport", "duration", "distance", "elevation", "description", "user_id", "route_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "activities".* FROM "activities"

    def destroy
        @activity = Activity.find(params[:id])
        if @activity
            @activity.destroy
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 3]]

     def update
        @activity = current_user.activities.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."user_id" = $1 AND "activities"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]