app/controllers/api/routes_controller.rb

    def show
        @route = Route.find(params[:id])
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @routes = Route.all
---
SELECT "routes".* FROM "routes"

    def create
        @route = Route.new(route_params)
        if @route.save
---
INSERT INTO "routes" ("route_name", "route_data", "route_description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        @route = Route.find(params[:id])
        if @route
            @route.destroy
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
DELETE FROM "routes" WHERE "routes"."id" = $1  [["id", 51]]